
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТЗРегламентныеЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ТЗРегламентныеЗадания.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока=Элементы.ТЗРегламентныеЗадания.ТекущиеДанные;
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("УникальныйИдентификатор",ТекущаяСтрока.УникальныйИдентификатор);
		ОткрытьФорму(ЭтотОбъект.ИмяФормы+"РегламентногоЗадания",СтруктураПараметров,ЭтотОбъект,,,,Новый ОписаниеОповещения("ОбновитьФорму", ЭтаФорма)); 
				
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

//События команд ТЗ Регламентные задания

//Обновление ТЗРегламентные задания
&НаСервере
Процедура ОбновитьСписокРегламентныхЗаданийНаСервере()
	
	Объект.ТЗРегламентныеЗадания.Очистить();
	
	МассивЗаданий=РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	
	Для Каждого Элемент Из МассивЗаданий Цикл		
		НоваяСтрока=Объект.ТЗРегламентныеЗадания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Элемент);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданий(Команда)
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	
КонецПроцедуры

//Добавление нового регламентного задания
&НаКлиенте
Процедура ДобавитьЗадание(Команда)
	
	ОткрытьФорму(ЭтотОбъект.ИмяФормы+"РегламентногоЗадания",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект) ); 
	
КонецПроцедуры

//Удаление регламентного задания
&НаСервере
Процедура УдалитьЗаданиеНаСервере(УникальныйИдентификатор)
	
	Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Задание=РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Задание.Удалить();	
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗадание(Команда)
	
	Если Элементы.ТЗРегламентныеЗадания.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока=Элементы.ТЗРегламентныеЗадания.ТекущиеДанные;			
		Если ТекущаяСтрока.Предопределенное Тогда
			Сообщить("Нельзя удалять предопределенные задания");	
		Иначе
			УдалитьЗаданиеНаСервере(ТекущаяСтрока.УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Выполнение регламентного задания
&НаСервере
Процедура ВыполнитьЗаданиеНаСервере(УникальныйИдентификатор)
	
	Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если Задание.Использование Тогда
		
		//проверика на выполнение в текущий момент
		Отбор=Новый Структура;
		Отбор.Вставить("Ключ",Строка(Задание.УникальныйИдентификатор));
		Отбор.Вставить("Состояние ",СостояниеФоновогоЗадания.Активно);		
		МассивЗаданий=ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
		Если МассивЗаданий.Количество()=0 Тогда 
			НаименованиеФоновогоЗадания = "Запуск вручную: "+ Задание.Метаданные.Синоним;
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, Строка(Задание.УникальныйИдентификатор), НаименованиеФоновогоЗадания);
		Иначе
			Сообщить("Задание уже запущено");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадание(Команда)
	
	Если Элементы.ТЗРегламентныеЗадания.ТекущиеДанные<>Неопределено Тогда		
		ТекущаяСтрока=Элементы.ТЗРегламентныеЗадания.ТекущиеДанные;	
		ВыполнитьЗаданиеНаСервере(ТекущаяСтрока.УникальныйИдентификатор);		
	КонецЕсли;	
	
КонецПроцедуры

//События комант ТЗ Фоновые задания

//Обновление ТЗ Фоновые задания
&НаСервере
Процедура ОбновитьСписокФоновыхЗаданийНаСервере()
	
	Объект.ТЗФоновыеЗадания.Очистить();
	
	МассивЗаданий=ФоновыеЗадания.ПолучитьФоновыеЗадания();
	
	Для Каждого Элемент Из МассивЗаданий Цикл
		НоваяСтрока=Объект.ТЗФоновыеЗадания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Элемент);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФоновыхЗаданий(Команда)
	
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры

//Отмена фонового задания
&НаСервере
Процедура ОтменитьЗаданиеНаСервере(УникальныйИдентификатор)
	
	Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Задание=ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Задание.Отменить();
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗадание(Команда)
	
	Если Элементы.ТЗФоновыеЗадания.ТекущиеДанные<>Неопределено Тогда		
		ТекущаяСтрока=Элементы.ТЗФоновыеЗадания.ТекущиеДанные;	
		ОтменитьЗаданиеНаСервере(ТекущаяСтрока.УникальныйИдентификатор);		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
//ПРОЧИЕ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьФорму(РезультатЗакрытия=Неопределено,ДополнительныеПараметры=Неопределено) Экспорт 
	
	ОбновитьСписокРегламентныхЗаданийНаСервере();
	ОбновитьСписокФоновыхЗаданийНаСервере();
	
КонецПроцедуры




