
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВремТЗ = ОбщегоНазначенияСервер.ПолучитьЗадачиСКоммитамиПослеРелиза();
	ЗначениеВРеквизитФормы(ВремТЗ, "Список");
КонецПроцедуры

&НаКлиенте
Процедура _Закрыть(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьВБраузере(Элемент, ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВБраузере(Элемент, ВыбраннаяСтрока)
	ТекСтрока = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	Если ТекСтрока <> Неопределено И ТекСтрока.Свойство("Задача") Тогда
		ВзаимодействиеC_JIRA_КлиентСервер.ОткрытьЗадачуВБраузере(ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ТекСтрока.Задача, "Код"));
	КонецЕсли;
КонецПроцедуры
