&НаКлиенте
Перем ИдентификаторФЗ;

&НаСервереБезКонтекста
Процедура ОбновитьЗадачиНаСервере(Строки)
	Номера = Новый Массив();
	Для Каждого Стр Из Строки Цикл
		Номера.Добавить(Стр.Номер);	
	КонецЦикла;
	РегистрыСведений.Задачи.ОбновитьЗадачи(Номера);
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьЗадачи(Команда)
	ИдентификаторФЗ = ЗапускЗадачНаСервере();
	Если ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		Элементы.СписокПолучитьЗадачи.Доступность = Ложь;
		ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьВыполненияФЗ", 1, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполненияФЗ()
	Если Не ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		Возврат	
	КонецЕсли;
	
	Если ОбщегоНазначенияСервер.ЗаданиеВыполнено(ИдентификаторФЗ) Тогда
		Элементы.СписокПолучитьЗадачи.Доступность = Истина;	
		ЭтаФорма.ОтключитьОбработчикОжидания("ПроверитьВыполненияФЗ");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВыделенные(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ОбновитьЗадачиНаСервере(ВыделенныеСтроки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИсториюПереходовНаСервере(Строки)
	Номера = Новый Массив();
	Для Каждого Стр Из Строки Цикл
		Номера.Добавить(Стр.Номер);	
	КонецЦикла;
	РегистрыСведений.ИсторияИзмененияСтатусов.ОбновитьЗаписи(Номера);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИсториюСписанийНаСервере(Строки)
	Номера = Новый Массив();
	Для Каждого Стр Из Строки Цикл
		Номера.Добавить(Стр.Номер);	
	КонецЦикла;
	РегистрыСведений.СписаниеВремени.ОбновитьЗаписи(Номера);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьИсториюПереходов(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ОбновитьИсториюПереходовНаСервере(ВыделенныеСтроки);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьИсториюСписаний(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ОбновитьИсториюСписанийНаСервере(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗапускЗадачНаСервере()	
	ФЗ = ФоновыеЗадания.Выполнить("ОбработкаРегламентныхЗаданий.ОбновитьЗадачи",, Строка(Новый УникальныйИдентификатор()), "Обновление задач");
	Возврат ФЗ.УникальныйИдентификатор;
КонецФункции

