/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьДанные(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите строку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	АдресФайлаВоВременномХранилище = "";
	ПолучитьДанныеНаСервере(АдресФайлаВоВременномХранилище, ТекущаяСтрока);
	ПолучитьФайл(АдресФайлаВоВременномХранилище, СтрШаблон("%1.zip", ТекущиеДанные.ИмяПодсистемы));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьДанныеНаСервере(Адрес, КлючЗаписи)
	Запись = РегистрыСведений.БФТ_ХранилищеМакетов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	ДанныеМакета = Запись.ДанныеМакета.Получить();
	Адрес = ПоместитьВоВременноеХранилище(ДанныеМакета, УникальныйИдентификатор);  
КонецПроцедуры

#КонецОбласти