/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Перем НомерРевизии, ОтобратьСвязанныеПо;
  
  Параметры.Свойство("НомерРевизии", НомерРевизии);
  Параметры.Свойство("ОтобратьСвязанныеПо", ОтобратьСвязанныеПо);
  Список.Параметры.УстановитьЗначениеПараметра("НомерРевизии", НомерРевизии);
  Список.Параметры.УстановитьЗначениеПараметра("ОтобратьСвязанныеПо", ОтобратьСвязанныеПо);
  
  БФТ_ОбщиеМетодыАРМаСборокНаСервере.СоздатьЭлементыФормыСписка(ЭтаФорма, Элементы.грРодитель);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаКлиенте
//Процедура ПолучитьИзмененияРепозитория(Элемент)
//  БФТ_ОбщиеМетодыАРМаСборокНаКлиенте.ЗагрузитьИзменения(ЭтаФорма);
//КонецПроцедуры

#КонецОбласти

