/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Перем НомерРевизии, ОтобратьСвязанныеПо;
  
  Параметры.Свойство("НомерРевизии", НомерРевизии);
  Параметры.Свойство("ОтобратьСвязанныеПо", ОтобратьСвязанныеПо);
  Список.Параметры.УстановитьЗначениеПараметра("НомерРевизии", НомерРевизии);
  Список.Параметры.УстановитьЗначениеПараметра("ОтобратьСвязанныеПо", ОтобратьСвязанныеПо);
	УстановитьОтборЗадачНаСервере(Новый Массив());
	
  БФТ_ОбщиеМетодыАРМаСборокНаСервере.СоздатьЭлементыФормыСписка(ЭтаФорма, Элементы.грРодитель);
КонецПроцедуры

&НаКлиенте
Процедура ПоискЗадач(Команда)
	ОткрытьФорму("Справочник.БФТ_НаборыИзменений.Форма.ФормаВводаСпискаЗадач",,,,,, Новый ОписаниеОповещения("ПоискЗадачЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьИзмененияРепозитория_Подключаемый(Элемент)
  БФТ_ОбщиеМетодыАРМаСборокНаКлиенте.ЗагрузитьИзменения(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ПоискЗадачЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	УстановитьОтборЗадачНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЗадачНаСервере(НомераЗадач)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗадачам", НомераЗадач.Количество() > 0);
	Список.Параметры.УстановитьЗначениеПараметра("НомераЗадач", НомераЗадач);
  
КонецПроцедуры

&НаКлиенте
Процедура СброситьПараметры(Команда)
	УстановитьОтборЗадачНаСервере(Новый Массив());
КонецПроцедуры

#КонецОбласти

