#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбновитьЗаписи(Номера = Неопределено) Экспорт 
		Если Номера = Неопределено Тогда
			СписокЗадач = ВзаимодействиеC_JIRA_КлиентСервер.ПолучитьЗадачиОбновленныеСегодня(Ложь);
		Иначе
			СписокЗадач = ВзаимодействиеC_JIRA_КлиентСервер.ПолучитьСписокЗадач(СтрШаблон("key in(%1)", СтрСоединить(Номера, ",")), Ложь);
		КонецЕсли;
		
		Для Каждого Задача Из СписокЗадач Цикл
			Лог = ВзаимодействиеC_JIRA_КлиентСервер.ПолучитьЛогСписанийПоЗадаче(Задача["key"]);
			
			Набор = РегистрыСведений.СписаниеВремени.СоздатьНаборЗаписей();
			Набор.Отбор.НомерЗадачи.Установить(Задача["key"]);
			
			Для Каждого ЗаписьЛога Из Лог Цикл
				Запись = Набор.Добавить();
				Запись.НомерЗаписи = Набор.Количество();
				Запись.НомерЗадачи = Задача["key"];
				Запись.Автор = Справочники.Пользователи.НайтиСоздатьПользователя(ЗаписьЛога["author"]);
				Запись.Комментарий = ЗаписьЛога["comment"];
				Запись.Часы = Число(ЗаписьЛога["timeSpentSeconds"]) / 60 / 60;
				Запись.Дата = ВзаимодействиеC_JIRA_КлиентСервер.ПреобразоватьВДату(ЗаписьЛога["created"]);
			КонецЦикла;
			
			Если Набор.Количество() > 0 Тогда
				Набор.Записать(Истина);	
			КонецЕсли;
		КонецЦикла;
	КонецПроцедуры
#КонецЕсли