/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Получить текст из документ DOM.
//
// Параметры:
//  ДокументDOM - ДокументDOM, ЭлементDOM - узел или документ DOM;
//  Кодировка - Строка - кодировка XML, по умолчанию "windows-1251".
//
// Возвращаемое значение:
//  Строка - текст XML.
//
Функция ПолучитьТекстИзДокументDOM(ДокументDOM, Кодировка = "windows-1251") Экспорт 
	Перем ЗаписьXML, ЗаписьDOM, XMLФайл;
	
	Если ТипЗнч(ДокументDOM) = Тип("Строка") Тогда
		Возврат ДокументDOM;
	ИначеЕсли ДокументDOM = Неопределено ИЛИ 
		(ТипЗнч(ДокументDOM)=Тип("ДокументDOM") И ДокументDOM.ПервыйДочерний = Неопределено) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(Кодировка);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	Результат = ЗаписьXML.Закрыть(); 
	
	Возврат Результат;
КонецФункции

Функция ПолучитьDOM(ТекстXML, СоздатьКопию=Ложь) Экспорт
  Перем ЧтениеXML, DOM, XML; 
	
	DOM = Новый ПостроительDOM;                      
  Если ТипЗнч(ТекстXML) = Тип("Строка") Тогда
    // BU-10905, BU-10954
    ЧтениеXML = УтилитыЧтенияXML.СоздатьИзТекста(ТекстXML);
    XML = DOM.Прочитать(ЧтениеXML);
    // XML = БФТ_ОбщегоНазначенияСерверПовтИсп.ПолучитьИзТекстаDOM(ТекстXML);
	ИначеЕсли ТипЗнч(ТекстXML) = Тип("ЧтениеXML") Тогда
		XML = DOM.Прочитать(ТекстXML); 
  ИначеЕсли СоздатьКопию Тогда
    XML = ТекстXML.КлонироватьУзел(Истина);	  
  Иначе
    XML = ТекстXML;
  КонецЕсли;
  
  Возврат XML;
КонецФункции

#КонецОбласти

