/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Перем НаборыИсключения;
  
  Параметры.Свойство("НаборыИсключения", НаборыИсключения);
  Список.Параметры.УстановитьЗначениеПараметра("НаборыИсключения", НаборыИсключения);
  Список.Параметры.УстановитьЗначениеПараметра("ИсключенияЗаданы", НаборыИсключения <> Неопределено);
КонецПроцедуры

#КонецОбласти
