/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Перем НаборыИсключения, Релиз;
  
  Параметры.Свойство("НаборыИсключения", НаборыИсключения);
	Параметры.Свойство("Релиз", Релиз);
	
  Список.Параметры.УстановитьЗначениеПараметра("НаборыИсключения", НаборыИсключения);
  Список.Параметры.УстановитьЗначениеПараметра("ИсключенияЗаданы", НаборыИсключения <> Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоПериодуКоммита", ЗначениеЗаполнено(Релиз));
	Если ЗначениеЗаполнено(Релиз) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Релиз.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Релиз.ДатаРелиза);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Неопределено);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
