
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// У новой записи _НомерСтроки будет 0
	Если Запись.ИсходныйКлючЗаписи._НомерСтроки = 0 Тогда
		ПоследнийНомерСтроки = ПолучитьПоследнийНомерСтроки();
		Запись._НомерСтроки = ПоследнийНомерСтроки +1;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПоследнийНомерСтроки()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БазыДляАвтоОбновления._НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрСведений.БазыДляАвтоОбновления КАК БазыДляАвтоОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ОповеститьОЗаписиНового(Запись.ИсходныйКлючЗаписи); чет не работает
	Оповестить("ИзмененыДанные");
КонецПроцедуры
