
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальнаяВерсия = ПолучитьПоследнююВерсию();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююВерсию()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Релизы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Релизы КАК Релизы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Релизы.ДатаРелиза УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Релизы.ПустаяСсылка();
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура _Закрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	Оповестить("ОбновитьРелизы");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	ДатаНачала = НачальнаяВерсия.ДатаРелиза;
	НомерРелизаРазбивка = СтрРазделить(НачальнаяВерсия.Наименование, ".");
	НомерРелиза = Число(НомерРелизаРазбивка[1]);
	
	Для а = 1 По КоличествоВерсий Цикл
		НомерРелиза = НомерРелиза +1;
		НомерРелизаРазбивка[1] = Строка(НомерРелиза);
		
		ДатаОкончания = ДатаНачала + ИнтервалВыпускаРелиза * 24*60*60;
		ВзаимодействиеC_JIRA_КлиентСервер.СоздатьВерсию(СтрСоединить(НомерРелизаРазбивка, "."), ДатаНачала, ДатаОкончания);
		ДатаНачала = ДатаОкончания;
	КонецЦикла;
КонецПроцедуры

