/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////


#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
  ПараметрыФормы = Новый Структура("", );
  ОткрытьФорму("ОбщаяФорма.БФТ_НастройкиПодключенияКХранилищу", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти