/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  УстановитьОтбор();
  ОбновитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		
  Менеджер = РеквизитФормыВЗначение("Настройки");
  Менеджер.Объект = Объект.Ссылка;
  Менеджер.Пользователь = ТекПользователь;
  Менеджер.Записать();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
  Если Не ЗначениеЗаполнено(Настройки.ИсполняемыйФайл) Тогда
    Отказ = Истина;
    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните поле ""Исполняемый файл""");
  КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсполняемыйФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
  ПутьКФайлу = ПолучитьИсполняемыйФайл();
  Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
    Настройки.ИсполняемыйФайл = ПутьКФайлу;
  КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНастройки()
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	
  Менеджер = РеквизитФормыВЗначение("Настройки");
  Менеджер.Объект = Объект.Ссылка;
  Менеджер.Пользователь = ТекПользователь;
  Менеджер.Прочитать();
  ЗначениеВРеквизитФормы(Менеджер, "Настройки");
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ЗаданыНастройкиДляТекущегоПользователя(ОбъектСсылка, Пользователь)
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БФТ_ПользовательскиеНастройкиПодключенияКРепозиторию.Пользователь
//		|ИЗ
//		|	РегистрСведений.БФТ_ПользовательскиеНастройкиПодключенияКРепозиторию КАК БФТ_ПользовательскиеНастройкиПодключенияКРепозиторию
//		|ГДЕ
//		|	БФТ_ПользовательскиеНастройкиПодключенияКРепозиторию.Пользователь = &Пользователь
//		|	И БФТ_ПользовательскиеНастройкиПодключенияКРепозиторию.Объект = &Объект";
//	
//	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
//	Запрос.УстановитьПараметр("Пользователь", Пользователь);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат Не РезультатЗапроса.Пустой();
//КонецФункции

&НаСервере
Процедура УстановитьОтбор()
  Методы.Отбор.Элементы.Очистить();
	ЭлементОтбора = Методы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;	
  ЭлементОтбора.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИсполняемыйФайл()
  #Если ВебКлиент Тогда 
    Каталог = КаталогДокументов();
  #Иначе
    Каталог = КаталогПрограммы();
  #КонецЕсли 
  
  Если ЗначениеЗаполнено(Настройки.ИсполняемыйФайл) Тогда
    Файл = Новый Файл(Настройки.ИсполняемыйФайл);  
    Каталог = Файл.Путь;
  КонецЕсли;
  
  Диалог            = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
  Диалог.Заголовок  = "Выберите исполняемый файл";
  Диалог.Фильтр     = "*.exe|*.exe";   
  Диалог.МножественныйВыбор = Ложь;
  Диалог.Каталог = Каталог; 
  
  Если Диалог.Выбрать() Тогда
    Возврат Диалог.ПолноеИмяФайла;
  КонецЕсли;  
КонецФункции

#КонецОбласти

