/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсполняемыйФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
  ПолучитьИсполняемыйФайл();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтбор()
  Методы.Отбор.Элементы.Очистить();
	ЭлементОтбора = Методы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;	
  ЭлементОтбора.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсполняемыйФайл()
  #Если ВебКлиент Тогда 
    Каталог = КаталогДокументов();
  #Иначе
    Каталог = КаталогПрограммы();
  #КонецЕсли 
  
  Если ЗначениеЗаполнено(Объект.ИсполняемыйФайл) Тогда
    Файл = Новый Файл(Объект.ИсполняемыйФайл);  
    Каталог = Файл.Путь;
  КонецЕсли;
  
  Диалог            = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
  Диалог.Заголовок  = "Выберите исполняемый файл";
  Диалог.Фильтр     = "*.exe|*.exe";   
  Диалог.МножественныйВыбор = Ложь;
  Диалог.Каталог = Каталог; 
	
	ОО = Новый ОписаниеОповещения("ЗавершениеВыбора", ЭтаФорма);
  Диалог.Показать(ОО);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбора(ВыбранныеФайлы, ДопПараметры) Экспорт 
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() = 1 Тогда
		Объект.ИсполняемыйФайл = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

