
Функция Следующий(Данные = Неопределено) Экспорт 
	Если Данные <> Неопределено И Данные.Свойство("РежимПроверки") И Данные.РежимПроверки Тогда
		Возврат Неопределено;	
	КонецЕсли;

	ЭтотОбъект.ТекущийИндекс = 	ЭтотОбъект.ТекущийИндекс +1;
	Возврат ЭтотОбъект.Таблица <> Неопределено И ЭтотОбъект.Таблица.Количество() > 0 И ЭтотОбъект.ТекущийИндекс <= ЭтотОбъект.Таблица.Количество();
КонецФункции

Функция ТекущийИндекс(Данные = Неопределено) Экспорт 
	Если Данные <> Неопределено И Данные.Свойство("РежимПроверки") И Данные.РежимПроверки Тогда
		Возврат Неопределено;	
	КонецЕсли;

	Возврат ЭтотОбъект.ТекущийИндекс-1;
КонецФункции

Функция ТекущийЭлемент(Данные = Неопределено) Экспорт 
	Если Данные <> Неопределено И Данные.Свойство("РежимПроверки") И Данные.РежимПроверки Тогда
		Возврат Неопределено;	
	КонецЕсли;

	Если ЭтотОбъект.Таблица = Неопределено ИЛИ 
		ЭтотОбъект.Таблица.Количество() = 0 ИЛИ
		ЭтотОбъект.ТекущийИндекс > ЭтотОбъект.Таблица.Количество()  Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтотОбъект.Таблица[ЭтотОбъект.ТекущийИндекс-1];
	КонецЕсли;	
КонецФункции

Процедура Сортировать(Данные) Экспорт 
	Если Данные <> Неопределено И Данные.Свойство("РежимПроверки") И Данные.РежимПроверки Тогда
		Возврат;	
	КонецЕсли;

	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции	

Функция Конструктор(ИсходнаяТаблица) Экспорт 
	ЭтотОбъект.Таблица = ИсходнаяТаблица;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция Наследовать(БазовыйОбъект) Экспорт 
	//ЭтотОбъект.БазовыйОбъект = БазовыйОбъект;	
	Возврат ЭтотОбъект;
КонецФункции

Функция Имплементация(ИнтерфейсИмя) Экспорт 
	Возврат Обработки[ИнтерфейсИмя].Создать().Имплементация(ЭтотОбъект);
КонецФункции

#КонецОбласти