Функция ПолучитьПоследнююЗапись(Изменения1С) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БФТ_ИзмененияРепозитория.Период КАК Период,
		|	БФТ_ИзмененияРепозитория.НомерРевизии КАК НомерРевизии,
		|	БФТ_ИзмененияРепозитория.ИзменениеКонфигурации КАК ИзменениеКонфигурации,
		|	БФТ_ИзмененияРепозитория.АвторИзменений КАК АвторИзменений,
		|	БФТ_ИзмененияРепозитория.Комментарий КАК Комментарий,
		|	БФТ_ИзмененияРепозитория.ТипИзменений КАК ТипИзменений
		|ИЗ
		|	РегистрСведений.БФТ_ИзмененияРепозитория КАК БФТ_ИзмененияРепозитория
		|ГДЕ
		|	БФТ_ИзмененияРепозитория.ИзменениеКонфигурации = &ИзменениеКонфигурации
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерРевизии УБЫВ";
	
	Запрос.УстановитьПараметр("ИзменениеКонфигурации", Изменения1С);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;	
	КонецЕсли;
КонецФункции
