

Процедура Посетить(Данные) Экспорт 
	Если Данные <> Неопределено И Данные.Свойство("РежимПроверки") И Данные.РежимПроверки Тогда
		Возврат;	
	КонецЕсли;
	
	
	Сообщить("Выполняется код посетителя 1");
	
КонецПроцедуры
 


#Область СлужебныеПроцедурыИФункции	

Функция Конструктор(УровеньЛогирования) Экспорт 
	
	Возврат ЭтотОбъект;
КонецФункции

Функция Наследовать(БазовыйОбъект) Экспорт 
	//ЭтотОбъект.БазовыйОбъект = БазовыйОбъект;	
	Возврат ЭтотОбъект;
КонецФункции

Функция Имплементация(ИнтерфейсИмя) Экспорт 
	Возврат Обработки[ИнтерфейсИмя].Создать().Имплементация(ЭтотОбъект);
КонецФункции

#КонецОбласти