/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
  
#Область ПрограммныйИнтерфейс

// Функция получает текст запроса для отбора при выгрузке.
//
// Возвращаемое значение: 
//  Строка - текст запроса.
//
Функция ЗапросОтбораДляВыгрузки() Экспорт 
	Возврат "ВЫБРАТЬ
	        |	Спр.Ссылка
	        |ИЗ
	        |	Справочник.БФТ_НастройкаПодключенияКРепозиторию КАК Спр
	        |ГДЕ
	        |	НЕ Спр.ПометкаУдаления";
КонецФункции

// Функция получает ссылку на элемент справочника "Настройка подключения к репозиторию (БФТ)".
//
// Возвращаемое значение: 
//  СправочникСсылка.БФТ_НастройкаПодключенияКРепозиторию - 
//    ссылка на элемент справочника "Настройка подключения к репозиторию (БФТ)".
//
Функция ПолучитьЕдинственнуюНастройкуПодключенияКРепозиторию() Экспорт 
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 2
    | БФТ_НастройкаПодключенияКРепозиторию.Ссылка
    |ИЗ
    | Справочник.БФТ_НастройкаПодключенияКРепозиторию КАК БФТ_НастройкаПодключенияКРепозиторию
    |ГДЕ
    | НЕ БФТ_НастройкаПодключенияКРепозиторию.ПометкаУдаления";
  
  Выборка = Запрос.Выполнить().Выбрать();
  Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
    Возврат Выборка.Ссылка;
  Иначе 
    Возврат Справочники.БФТ_НастройкаПодключенияКРепозиторию.ПустаяСсылка();
  КонецЕсли;
КонецФункции

// Функция получает ссылку на элемент справочника "Методы работы с репозиторием (БФТ)".
//
// Параметры:
//  ВладелецСсылка - СправочникСсылка.БФТ_НастройкаПодключенияКРепозиторию - 
//    ссылка на элемент справочника "Настройка подключения к репозиторию (БФТ)"; 
//  ИмяКоманды - Строка - имя команды.
//
// Возвращаемое значение: 
//  СправочникСсылка.БФТ_МетодыРаботыСРепозиторием - 
//    ссылка на элемент справочника "Методы работы с репозиторием (БФТ)".
//
Функция ПолучитьМетод(ВладелецСсылка, ИмяКоманды) Экспорт 
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    | БФТ_МетодыРаботыСРепозиторием.Ссылка
    |ИЗ
    | Справочник.БФТ_МетодыРаботыСРепозиторием КАК БФТ_МетодыРаботыСРепозиторием
    |ГДЕ
    | БФТ_МетодыРаботыСРепозиторием.Наименование = &Наименование
    | И БФТ_МетодыРаботыСРепозиторием.Владелец = &Владелец";
  
  Запрос.УстановитьПараметр("Владелец", ВладелецСсылка);
  Запрос.УстановитьПараметр("Наименование", ИмяКоманды);
  
  Выборка = Запрос.Выполнить().Выбрать();
  Если Выборка.Следующий() Тогда
    Возврат Выборка.Ссылка;
  Иначе
    Возврат Справочники.БФТ_МетодыРаботыСРепозиторием.ПустаяСсылка();
  КонецЕсли;
КонецФункции


// Функция - Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение: 
//  Массив(Строка) - массив имен реквизитов, образующих естественный ключ.
//
&НаСервере
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Код");
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#КонецЕсли