//Процедура УстановитьПроцентВыполнения(Процент) Экспорт 
//	Если ПараметрыСеанса.НеИнтерактивноеВыполнение Тогда
//		ПараметрыСеанса.ПроцентВыполнения = Процент;
//		Сообщить("{{" + Строка(ПараметрыСеанса.ПроцентВыполнения) + "}}");
//	КонецЕсли;
//КонецПроцедуры

//Функция ДобавитьКТекущемуПроцентуВыполнения(Процент) Экспорт 
//	Если ПараметрыСеанса.НеИнтерактивноеВыполнение Тогда
//		ПараметрыСеанса.ПроцентВыполнения = Цел(ПараметрыСеанса.ПроцентВыполнения + Процент);
//		Сообщить("{{" + Строка(ПараметрыСеанса.ПроцентВыполнения) + "}}");
//	КонецЕсли;
//	
//	Возврат ПараметрыСеанса.ПроцентВыполнения;
//КонецФункции
