&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Год = Год(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура РабочаяНеделяПриИзменении(Элемент)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура РабочийДеньПриИзменении(Элемент)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементы()
	Элементы.РабочаяНеделя.Заголовок = СтрШаблон("Рабочая неделя: %1", НаборКонстант.РабочаяНеделя);
	Элементы.РабочийДень.Заголовок = СтрШаблон("Рабочий день в часах: %1", НаборКонстант.РабочийДень);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НастройкиИзменены");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере(Год);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьГрафикНаСервере(Год)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	Пользователи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	РабЧасов = Константы.РабочийДень.Получить();
	РабЧасов = ?(РабЧасов = 0, 8, РабЧасов);
	
	РабДней = Константы.РабочаяНеделя.Получить();
	РабДней = ?(РабДней = 0, 5, РабДней);
	
	КолДней = Окр((КонецГода(Дата(Год, 1, 1)) - НачалоГода(Дата(Год, 1, 1))) / 24 /60 /60, 0, РежимОкругления.Окр15как20);
	Для День = 1 По КолДней Цикл
		Дата = НачалоГода(Дата(Год, 1, 1)) + День * 24 * 60 * 60;

		Если ДеньНедели(Дата) > РабДней Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Пользователь Из Пользователи Цикл
			Запись = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
			Запись.Дата = Дата;
			Запись.Пользователь = Пользователь;
			Запись.РабочихЧасов = РабЧасов;
			Запись.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


 