
Процедура ОтправитьУведомлениеОСменеДаты(НомераЗадач) Экспорт 
	ДанныеДляОтправки = РаботаСПочтовымиСообщениями.СформироватьДанныеДляОтправки(НомераЗадач);
	Для Каждого Данные Из ДанныеДляОтправки Цикл
		ПараметрыПисьма = РаботаСПочтовымиСообщениями.ПодготовитьПараметрыПисьма(Данные);
		
		ОписаниеОшибки = "";
		ТекстСообщения = "";
		УспешноеВыполнение = РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПараметрыПисьма, ОписаниеОшибки, ПараметрыПисьма.ТелоHTML);
		Если Не УспешноеВыполнение Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось отправить письмо ответственному по адресу %1.
			|%2'"), ПараметрыПисьма.АдресПолучателя, ОписаниеОшибки); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


