/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура загрузки изменений
//
// Параметры:
//  Форма  - УправляемаяФорма - форма;
//  НастройкаПодключенияКРепозиторию  - Произвольный - настройки.
//
Процедура ЗагрузитьИзменения(Форма, Знач НастройкаПодключенияКРепозиторию = Неопределено) Экспорт 
	Перем КодВозврата;
	
	#Если Не ВебКлиент Тогда
		Если (Не ОбщегоНазначенияКлиентСервер.НаличиеСвойстваУОбъекта(Форма, "НастройкаПодключенияКРепозиторию") 
			Или (Не ЗначениеЗаполнено(Форма.НастройкаПодключенияКРепозиторию))) И НастройкаПодключенияКРепозиторию = Неопределено Тогда
			Сообщить("Заполните настройки");
			Возврат;  
		КонецЕсли;
		
		НастройкаПодключенияКРепозиторию = ?(НастройкаПодключенияКРепозиторию = Неопределено, Форма.НастройкаПодключенияКРепозиторию, НастройкаПодключенияКРепозиторию);
		
		ВремФайл = ПолучитьИмяВременногоФайла("xml");
		Попытка
			Текст =  БФТ_ОбщиеМетодыАРМаСборокНаКлиентеНаСервере.ВыполнитьМетод(НастройкаПодключенияКРепозиторию, "log");
			Если Не ЗначениеЗаполнено(Текст) Тогда
				Возврат;	
			КонецЕсли;
			
			форма = Новый ЗаписьТекста(ВремФайл);
			форма.ЗаписатьСтроку(Текст);
			форма.Закрыть();
			
			Файл = Новый Файл(ВремФайл);
			Если Файл.Существует() Тогда
				АдресФайла = Неопределено;
				ОО = Новый ОписаниеОповещения("НачатьПомещениеФайлаЗавершение", БФТ_ОбщиеМетодыАРМаСборокНаКлиенте);
				НачатьПомещениеФайла(ОО, АдресФайла, ВремФайл, Ложь, Форма.УникальныйИдентификатор);
			КонецЕсли;
			
			УдалитьФайлы(ВремФайл);
		Исключение
			УдалитьФайлы(ВремФайл);
			ВызватьИсключение;
		КонецПопытки;  
	#Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данное действие не доступно для веб клиента");
	#КонецЕсли
КонецПроцедуры

// Процедура завершения события начать помещение файла.
//
// Параметры:
//  Результат  - Произвольный - что-то;
//  Адрес  - Произвольный - что-то;
//  ВыбранноеИмяФайла  - Произвольный - Не используется;
//  ДополнительныеПараметры  - Произвольный - Не используется.
//
&НаКлиенте
Процедура НачатьПомещениеФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
  Если Результат Тогда
    БФТ_ОбщиеМетодыАРМаСборокНаСервере.РазобратьФайл(Адрес, Неопределено);
  КонецЕсли;
КонецПроцедуры


#КонецОбласти         

