&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	Данные = ОбщегоНазначенияСервер.ПолучитьРасхождениеПоДатам();
	ЗначениеВРеквизитФормы(Данные, "Таблица");
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбновлениеЗадач()
	Справочники.Задачи.ОбновитьЗадачи();
КонецПроцедуры


&НаКлиенте
Процедура Закрыть_(Команда)
	Оповестить("ИзмененияДатСохранено");
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура АктуализироватьДаты(Команда)
	Для Каждого Стр Из Таблица Цикл	
		ВзаимодействиеC_JIRA_КлиентСервер.ИзменитьДатуЗавершения(Стр.НомерЗадачи, Стр.ДатаРелиза, Истина);
	КонецЦикла;
	
	ПолучитьОбновлениеЗадач();
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Таблица.ДанныеСтроки(ВыбраннаяСтрока);
	Если ТекСтрока <> Неопределено Тогда
		ВзаимодействиеC_JIRA_КлиентСервер.ОткрытьЗадачуВБраузере(ТекСтрока.НомерЗадачи);
	КонецЕсли;
КонецПроцедуры

