&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	Данные = ОбщегоНазначенияСервер.ПолучитьРасхождениеПоДатам();
	ЗначениеВРеквизитФормы(Данные, "Таблица");
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбновлениеЗадач()
	Справочники.Задачи.ОбновитьЗадачи(Таблица.Выгрузить().ВыгрузитьКолонку("НомерЗадачи"));
КонецПроцедуры


&НаКлиенте
Процедура Закрыть_(Команда)
	Оповестить("ИзмененияДатСохранено");
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура АктуализироватьДаты(Команда)
	ВыделенныеСтроки = Элементы.Таблица.ВыделенныеСтроки;
	Для Каждого Стр Из Таблица Цикл	
		Для Каждого ИндексСтроки Из ВыделенныеСтроки Цикл
			Если ИндексСтроки = Таблица.Индекс(Стр) Тогда
				ВзаимодействиеC_JIRA_КлиентСервер.ИзменитьДатуЗавершения(Стр.НомерЗадачи, Стр.ДатаРелиза, Истина);
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьОбновлениеЗадач();
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВерсиюВЗадачу(Команда)
	ВыделенныеСтроки = Элементы.Таблица.ВыделенныеСтроки;
	Для Каждого Стр Из Таблица Цикл	
		Для Каждого ИндексСтроки Из ВыделенныеСтроки Цикл
			Если ИндексСтроки = Таблица.Индекс(Стр) Тогда
				ДобавитьВерсию(Стр.Задача, Стр.Релиз);
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьОбновлениеЗадач();
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Таблица.ДанныеСтроки(ВыбраннаяСтрока);
	Если ТекСтрока <> Неопределено Тогда
		ВзаимодействиеC_JIRA_КлиентСервер.ОткрытьЗадачуВБраузере(ТекСтрока.НомерЗадачи);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВерсию(Задача, Релиз)
	Справочники.Релизы.ДобавитьВВерсию(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Задача), Релиз);	
КонецПроцедуры


