
&НаКлиенте
Процедура Закрыть_(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Исправить(Команда)
	Для Каждого Стр Из СписокЗадач Цикл
		Если Стр.ТипСабтаскаРодитель = ПредопределенноеЗначение("Справочник.ТипыЗадач.Разработка") Тогда
			ОценкаОбщая = Стр.СабтаскОценка / ОбщегоНазначенияКлиентСервер.КоэффициентРазработки();
		ИначеЕсли Стр.ТипСабтаскаРодитель = ПредопределенноеЗначение("Справочник.ТипыЗадач.Тестирование") Тогда
			ОценкаОбщая = Стр.СабтаскОценка / ОбщегоНазначенияКлиентСервер.КоэффициентТестирования();
		КонецЕсли;
		
		//ОценкаРазработка = ОценкаОбщая * ОбщегоНазначенияКлиентСервер.КоэффициентРазработки();
		//ОценкаТестирования = ОценкаОбщая * ОбщегоНазначенияКлиентСервер.КоэффициентТестирования();
		
		Оценки = Новый Структура("Общая", ОценкаОбщая);
		Данные = Новый Структура("Оценки", Оценки);

		ВзаимодействиеC_JIRA_КлиентСервер.УстановитьОценкуВыполненияИВремяЗадачи(Стр.Номер, Данные, Ложь);
		//ВзаимодействиеC_JIRA_КлиентСервер.ОбновитьДанныеСабтасков(Стр.Номер, Данные);
	КонецЦикла;
	
	ОбновитьНаСервере();
	
	Если СписокЗадач.Количество() = 0 Тогда
		Оповестить("ОценкаСохранено");		
	КонецЕсли;
КонецПроцедуры




//&НаСервере
//Процедура ОбновитьЗадачи(НомераЗадач)
//	Если НомераЗадач.Количество() > 0 Тогда
//		РегистрыСведений.Задачи.ОбновитьЗадачи(НомераЗадач);
//		ОбновитьНаСервере();
//	КонецЕсли;	
//КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	СписокЗадач.Очистить();
	
	Выборка = ОбщегоНазначенияСервер.ПолучитьРасхождениеВОценках();
	Пока Выборка.Следующий() Цикл
		НовСтр = СписокЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.СписокЗадач.ДанныеСтроки(ВыбраннаяСтрока);
	Если ДанныеСтроки <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДанныеСтроки.Номер) Тогда
			ВзаимодействиеC_JIRA_КлиентСервер.ОткрытьЗадачуВБраузере(ДанныеСтроки.Номер);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСтроки.СабтаскНомер) Тогда
			ВзаимодействиеC_JIRA_КлиентСервер.ОткрытьЗадачуВБраузере(ДанныеСтроки.СабтаскНомер);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
