&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоДня(ТекущаяДатаСеанса()));
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзJIRA(Команда)
	ОбновитьВерсии();	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьВерсии()
	Справочники.Релизы.ОбновитьВерсии();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПатч(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Сообщить("Выберите строку релиза");
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ДобавитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСборкуРелиза(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Сообщить("Выберите строку релиза");
		Возврат;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		Отказ = Истина;
		Сообщить("Запрещено создавать новые версии. Версии загружаются из JIRA");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

