Функция НайтиСоздатьВерсию(ДанныеВерсии) Экспорт 
	Если ДанныеВерсии = Неопределено Тогда
		Возврат Справочники.Релизы.ПустаяСсылка();	
	КонецЕсли;
	
	Код = Число(ДанныеВерсии["id"]);
	ВерсияСсылка = НайтиРелизПоКоду(Код);
	
	Версия = ?(ЗначениеЗаполнено(ВерсияСсылка), ВерсияСсылка.ПолучитьОбъект(), Справочники.Релизы.СоздатьЭлемент());
	Версия.Наименование = ДанныеВерсии["name"];
	Версия.Код = Код;
	ДатаРелизаСтрокой = ДанныеВерсии["releaseDate"];
	
	Если ЗначениеЗаполнено(ДатаРелизаСтрокой) Тогда
		Версия.ДатаРелиза = ВзаимодействиеC_JIRA_КлиентСервер.ПреобразоватьВДату(ДатаРелизаСтрокой);
	КонецЕсли;
	Версия.Записать();
	
	Возврат Версия.Ссылка;
КонецФункции

Функция НайтиРелизПоКоду(Код)
	// у релиза и у патча номера будут обинаковы, по этому мы поиск производим только по элементам не имеющим родителя
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Релизы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Релизы КАК Релизы
		|ГДЕ
		|	Релизы.Код = &Код
		|	И Релизы.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Родитель", Справочники.Релизы.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Релизы.ПустаяСсылка();
	КонецЕсли;
КонецФункции
