/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
  Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
    Возврат;  
  КонецЕсли;
  
  ПараметрыФормы = Новый Структура("Наборы", ПолучитьСписокНаборов(ПараметрКоманды));
  ОткрытьФорму("РегистрСведений.БФТ_ИзмененияРепозитория.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокНаборов(СборкаСсылка)
  Если Не ЗначениеЗаполнено(СборкаСсылка) Тогда
    Возврат Новый Массив();  
  КонецЕсли;
  
  СборкаОбъект = СборкаСсылка.ПолучитьОбъект();
  Возврат СборкаОбъект.НаборыИзменений.Выгрузить().ВыгрузитьКолонку("НаборИзменений");
КонецФункции

#КонецОбласти
