/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
  
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
  СтандартнаяОбработка = Ложь;
  
  Поля.Добавить("Код");
  Поля.Добавить("Наименование");
  Поля.Добавить("Дата");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
  СтандартнаяОбработка = Ложь;
  Представление = СтрШаблон("%1 %2 от %3", Данные.Код, Данные.Наименование, Данные.Дата);
КонецПроцедуры

#КонецОбласти

#КонецЕсли