&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ИдентификаторПользователя = Константы.ПользовательНастроек.Получить();
	
	УправлениеВидимостьюЭлементов();
	JIRA_Password = ХранилищеОбщихНастроек.Загрузить("Настройки JIRA", "JIRA_Password");
	JIRA_Login = ХранилищеОбщихНастроек.Загрузить("Настройки JIRA", "JIRA_Login");
	
	//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователя);
	//Если ПользовательИБ <> Неопределено Тогда
	//	ПользовательНастроек = ?(ЗначениеЗаполнено(ПользовательИБ.ПолноеИмя), ПользовательИБ.ПолноеИмя, "<Системный>");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НастройкиИзменены");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов()
	// Проверка корректности заполнения настроек подключения к JIRA
	Ошибки = ОбщегоНазначенияСервер.ПроверкаЗаполненияНастроекJIRA();
	Элементы.грОшибки.Видимость = ЗначениеЗаполнено(Ошибки);
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ИдентификаторПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	
	ХранилищеОбщихНастроек.Сохранить("Настройки JIRA", "JIRA_Password", JIRA_Password);
	ХранилищеОбщихНастроек.Сохранить("Настройки JIRA", "JIRA_Login", JIRA_Login);
	Константы.ПользовательНастроек.Установить(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
КонецПроцедуры

