#Область ПрограммныйИнтерфейс

Функция Следующий(Данные = Неопределено) Экспорт 
	Если ЭтотОбъект.РеализующийОбъект = Неопределено Тогда
		ВызватьИсключение "Интервейс не имплементирован";	 
	КонецЕсли;
	
	Возврат ЭтотОбъект.РеализующийОбъект.Следующий(Данные);
КонецФункции

Функция ТекущийИндекс(Данные = Неопределено) Экспорт 
	Если ЭтотОбъект.РеализующийОбъект = Неопределено Тогда
		ВызватьИсключение "Интервейс не имплементирован";	 
	КонецЕсли;
	
	Возврат ЭтотОбъект.РеализующийОбъект.ТекущийИндекс(Данные);
КонецФункции

Функция ТекущийЭлемент(Данные = Неопределено) Экспорт 
	Если ЭтотОбъект.РеализующийОбъект = Неопределено Тогда
		ВызватьИсключение "Интервейс не имплементирован";	 
	КонецЕсли;
	
	Возврат ЭтотОбъект.РеализующийОбъект.ТекущийЭлемент(Данные);
КонецФункции

Процедура Сортировать(Данные) Экспорт 
	Если ЭтотОбъект.РеализующийОбъект = Неопределено Тогда
		ВызватьИсключение "Интервейс не имплементирован";	 
	КонецЕсли;
	
	ЭтотОбъект.РеализующийОбъект.Сортировать(Данные);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Функция Имплементация(Объект) Экспорт 
	Методы = Новый Массив();
	Методы.Добавить("Следующий");
	Методы.Добавить("ТекущийИндекс");
	Методы.Добавить("ТекущийЭлемент");
	Методы.Добавить("Сортировать");
	
	ПроверитьСуществованиеМетодов(Объект, Методы);
	ЭтотОбъект.РеализующийОбъект = Объект;
	
	Возврат ЭтотОбъект;
КонецФункции

Процедура ПроверитьСуществованиеМетодов(Объект, Методы)
	ОтсутствующиеМетоды = Новый Массив();
	Для Каждого Метод Из Методы Цикл
		Попытка
			Параметры = Новый Структура("РежимПроверки", Истина);
			Выполнить(СтрШаблон("Объект.%1(Параметры)", Метод));
		Исключение
			ОтсутствующиеМетоды.Добавить(Метод);
		КонецПопытки;
	КонецЦикла;
	
	Если ОтсутствующиеМетоды.Количество() > 0 Тогда
		ВызватьИсключение СтрШаблон("В обработке отсутствуют методы:
		|%1", СтрСоединить(ОтсутствующиеМетоды, Символы.ПС));	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
