/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  БФТ_ОбщиеМетодыАРМаСборокНаСервере.СоздатьЭлементыФормыСписка(ЭтаФорма, Элементы.грРодитель);
  Список.Параметры.УстановитьЗначениеПараметра("Наборы", Параметры.Наборы); 
  Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНаборамЗадан", Параметры.Наборы <> Неопределено); 
  
  Элементы.ФормаВыбрать.Видимость = Параметры.РежимВыбора;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
  Если Параметры.РежимВыбора Тогда
    Выбрать(Элемент);
  КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
  ТекущиеДанные = Элементы.Список.ТекущиеДанные;
  ДанныеВыбора = Неопределено;
  Если ТекущиеДанные <> Неопределено Тогда
    ДанныеВыбора = ТекущиеДанные.НомерРевизии;  
  КонецЕсли;
  
  ОповеститьОВыборе(ДанныеВыбора);
КонецПроцедуры

#КонецОбласти