Процедура ОповеститьПользователя() Экспорт 
	НовыеЗадачи = ОбщегоНазначенияСервер.ПолучитьНомераНовыхЗаписей();
	Если НовыеЗадачи.Количество() > 0 Тогда
		ОО = Новый ОписаниеОповещения("СнятьФлагЭтоНовый", ЭтотОбъект, Новый Структура("НовыеЗадачи", СтрСоединить(НовыеЗадачи, Символы.ПС)));
		ПоказатьОповещениеПользователя("Есть новые задачи", ОО, СтрШаблон("Создано %1 новых задач", НовыеЗадачи.Количество()),, СтатусОповещенияПользователя.Важное);
	КонецЕсли;
КонецПроцедуры

Процедура СнятьФлагЭтоНовый(ДД) Экспорт 
	Перем НовыеЗадачи;
	
	Если ДД.Свойство("НовыеЗадачи", НовыеЗадачи) И НовыеЗадачи <> Неопределено Тогда 
		Сообщить(НовыеЗадачи);	
	КонецЕсли;
	
	ОбщегоНазначенияСервер.СнятьФлагЭтоНовая();
КонецПроцедуры
