Функция НайтиСоздатьПриоритет(ДанныеПриоритета) Экспорт 
	Если ДанныеПриоритета = Неопределено Тогда
		Возврат Справочники.Приоритеты.ПустаяСсылка();	
	КонецЕсли;
	
	Приоритет =  Справочники.Приоритеты.НайтиПоКоду(Число(ДанныеПриоритета["id"]));
	Если ЗначениеЗаполнено(Приоритет) Тогда
		Возврат Приоритет;	
	КонецЕсли;
	
	Приоритет = Справочники.Приоритеты.СоздатьЭлемент();
	Приоритет.Наименование = ДанныеПриоритета["name"];
	Приоритет.Код = Число(ДанныеПриоритета["id"]);
	//Если ВРег(Приоритет.Наименование) = "ВАЖНЫЙ" Тогда
	//	Приоритет.Индекс = 0;
	//КонецЕсли;
	Приоритет.Записать();
	
	Возврат Приоритет.Ссылка;
КонецФункции
