/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Получает текст JSON из структуры.
//
// Параметры:
//   ИсходнаяСтруктура - Структура - структура для преобразования.
//
// Возвращаемое значение:
//   Строка - текст JSON.
//
Функция СтруктуруВJSON(ИсходнаяСтруктура) Экспорт 
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, ИсходнаяСтруктура); 
	
	Возврат ЗаписьJSON.Закрыть();	
КонецФункции

// Функция - Получает структуру из текста JSON.
//
// Параметры:
//   ТелоJSON - Строка - текст JSON.
//
// Возвращаемое значение:
//   Структура - структура полученная из текста JSON.
//
Функция СтруктуруИзJSON(ТелоJSON) Экспорт 
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТелоJSON);
	ОтветОбъект = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ОтветОбъект;
КонецФункции

#КонецОбласти

